[
    {
      "id": 1,
      "date": "2025-02-01",
      "overall_rating": 9,
      "comment": "Absolutely loved my day at the races! The atmosphere was electric and the staff were very attentive. Food at the premium lounge was delicious, though slightly overpriced. Will definitely be back next month.",
      "member_id": "M1001"
    },
    {
      "id": 2,
      "date": "2025-02-01",
      "overall_rating": 5,
      "comment": "The race viewing was excellent but the food was cold when it arrived. Waited 45 minutes for our order and the staff seemed overwhelmed. Beautiful venue though and the races themselves were thrilling.",
      "member_id": "M1002"
    },
    {
      "id": 3,
      "date": "2025-02-08",
      "overall_rating": 8,
      "comment": "Great day out with the family. The kids' area was fantastic and kept our children entertained. Food options were decent, though more vegetarian choices would be appreciated. The races were exciting and well-organized.",
      "member_id": "M1003"
    },
    {
      "id": 4,
      "date": "2025-02-08",
      "overall_rating": 3,
      "comment": "Very disappointed with today's experience. The parking was a nightmare and took 30 minutes to find a spot. The seating area was dirty and the screens showing the races were malfunctioning. Food was good though and the staff tried their best.",
      "member_id": "M1004"
    },
    {
      "id": 5,
      "date": "2025-02-15",
      "overall_rating": 7,
      "comment": "The racing was top-notch as always but the facilities are starting to show their age. Bathrooms weren't clean and there were long lines at all the food vendors. The staff were friendly and helpful though.",
      "member_id": "M1005"
    },
    {
      "id": 6,
      "date": "2025-02-15",
      "overall_rating": 10,
      "comment": "Perfect day at the races! Everything from the parking to the food to the races themselves was impeccably organized. The new mobile betting app made placing bets so convenient. Staff were knowledgeable and courteous.",
      "member_id": "M1006"
    },
    {
      "id": 7,
      "date": "2025-02-22",
      "overall_rating": 6,
      "comment": "The races were exciting but the crowd management needs improvement. Too many people in too small a space. Food was excellent though and worth the price. Mixed feelings overall.",
      "member_id": "M1007"
    },
    {
      "id": 8,
      "date": "2025-02-22",
      "overall_rating": 4,
      "comment": "Service was terrible today. Waited forever for drinks and when they arrived, the order was wrong. The racing itself was good and the jockeys were impressive, but the customer service really let the experience down.",
      "member_id": "M1008"
    },
    {
      "id": 9,
      "date": "2025-03-01",
      "overall_rating": 8,
      "comment": "Lovely atmosphere and great races. The commentary was informative and added to the excitement. Food options were diverse but a bit expensive. Facilities were clean and well-maintained.",
      "member_id": "M1009"
    },
    {
      "id": 10,
      "date": "2025-03-01",
      "overall_rating": 7,
      "comment": "Good experience overall. The VIP section was worth the upgrade for the better viewing angles. Food was just okay, nothing special. Staff were attentive but seemed understaffed during peak times.",
      "member_id": "M1010"
    },
    {
      "id": 11,
      "date": "2025-03-08",
      "overall_rating": 9,
      "comment": "Outstanding day! The new seating arrangements are much better than before. Food was delicious and arrived promptly. Only minor complaint is the cost of drinks, which seems to increase every visit.",
      "member_id": "M1011"
    },
    {
      "id": 12,
      "date": "2025-03-08",
      "overall_rating": 2,
      "comment": "Terrible experience from start to finish. The parking was chaotic, the entrance was disorganized, and the food was inedible. The only redeeming quality was the actual horse racing, which was excellent as always.",
      "member_id": "M1012"
    },
    {
      "id": 13,
      "date": "2025-03-15",
      "overall_rating": 6,
      "comment": "The racing program was well-organized but the facilities need updating. Bathrooms were out of order and the seating was uncomfortable. Food was surprisingly good though and reasonably priced.",
      "member_id": "M1013"
    },
    {
      "id": 14,
      "date": "2025-03-15",
      "overall_rating": 8,
      "comment": "Really enjoyed today's races! The new race guide app is fantastic and made tracking the horses much easier. Food was decent and served quickly. The venue was clean but the PA system needs improvement as announcements were hard to hear.",
      "member_id": "M1014"
    },
    {
      "id": 15,
      "date": "2025-03-22",
      "overall_rating": 5,
      "comment": "Mixed feelings about today. The races were exciting but there were issues with ticketing that took ages to resolve. Food was cold and overpriced. Staff were apologetic but clearly not trained properly.",
      "member_id": "M1015"
    },
    {
      "id": 16,
      "date": "2025-03-22",
      "overall_rating": 9,
      "comment": "What a fantastic day! The special members' lounge was worth every penny with excellent service and delicious food. The races were thrilling and the atmosphere was electric. Minor issue with parking but otherwise perfect.",
      "member_id": "M1016"
    },
    {
      "id": 17,
      "date": "2025-03-29",
      "overall_rating": 7,
      "comment": "Good day out but not exceptional. Food was tasty but limited options for those with dietary restrictions. Races were well-organized and on time. Staff were friendly but the venue was too crowded.",
      "member_id": "M1017"
    },
    {
      "id": 18,
      "date": "2025-03-29",
      "overall_rating": 4,
      "comment": "Disappointed with the experience. The food was bland and cold, the toilets were dirty, and the staff seemed disinterested. The races themselves were exciting but everything else needs improvement.",
      "member_id": "M1018"
    },
    {
      "id": 19,
      "date": "2025-04-05",
      "overall_rating": 10,
      "comment": "Couldn't have asked for a better day! From the moment we arrived, everything was perfect. Excellent food, friendly staff, clean facilities, and thrilling races. The new kids' entertainment area is a great addition.",
      "member_id": "M1019"
    },
    {
      "id": 20,
      "date": "2025-04-05",
      "overall_rating": 3,
      "comment": "Not worth the money today. Long queues for everything, average food at premium prices, and the viewing areas were overcrowded. The races were good but couldn't enjoy them properly due to these issues.",
      "member_id": "M1020"
    },
    {
      "id": 21,
      "date": "2025-04-12",
      "overall_rating": 8,
      "comment": "Thoroughly enjoyed our day. The race card was exciting with some unexpected results! Food services were quick and the quality was good. Only drawback was the limited covered seating when it started to rain.",
      "member_id": "M1021"
    },
    {
      "id": 22,
      "date": "2025-04-12",
      "overall_rating": 6,
      "comment": "An okay experience. The races were run efficiently but the catering was disappointing. Ordered the premium lunch package and it wasn't worth the money. Staff were helpful when approached but not proactive.",
      "member_id": "M1022"
    },
    {
      "id": 23,
      "date": "2025-04-19",
      "overall_rating": 9,
      "comment": "Excellent day at the races! The special Easter event was well-organized with great activities for everyone. Food was delicious and plentiful. Staff went above and beyond to make it a memorable experience.",
      "member_id": "M1023"
    },
    {
      "id": 24,
      "date": "2025-04-19",
      "overall_rating": 5,
      "comment": "The racing was exciting but everything else was average. Food took forever to arrive and was lukewarm. Facilities were clean but dated. Staff seemed overwhelmed by the holiday crowd.",
      "member_id": "M1024"
    },
    {
      "id": 25,
      "date": "2025-04-26",
      "overall_rating": 7,
      "comment": "A good day overall. The racing was excellent and well-managed. Food was hit and miss - some items were delicious while others were disappointing. Venue was clean but some areas need modernization.",
      "member_id": "M1025"
    }
  ]